In [8]:
#import data set using pandas

import pandas as pd

In [10]:
pwd

'C:\\Users\\John Lardis\\Unit-2-Homework-Assignment-Automate-Your-Day-Job-with-Python'

In [15]:
#testing to use full file name in case file is outside of working folder 
pd.read_csv('C:\\Users\\John Lardis\\Unit-2-Homework-Assignment-Automate-Your-Day-Job-with-Python\\budget_data.csv')

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [16]:
#using file name only as folder is in working directory

pd.read_csv('budget_data.csv')

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [45]:
#setting a new variable for budget_data - Do this to stop pulling in the table all the time 

df = pd.read_csv('budget_data.csv')

In [46]:
#test to see if variable is pulling the right information 

df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [ ]:
#Yes it works!!!

In [43]:
#Next step is to count the total number of months - so we want to count all the months in column 2 or count column 1 assuming all values in column 2 are unique right. 
#How to we check this? 
#start off with a simple count then work from there

#create new dictionary?? lets try 

month = {}

for row in budget_data:
    month[row(0)] = {"Profit_Loss":row(1)}

In [51]:
d=df.to_dict(orient="dict")
d

{'Date': {0: 'Jan-2010',
  1: 'Feb-2010',
  2: 'Mar-2010',
  3: 'Apr-2010',
  4: 'May-2010',
  5: 'Jun-2010',
  6: 'Jul-2010',
  7: 'Aug-2010',
  8: 'Sep-2010',
  9: 'Oct-2010',
  10: 'Nov-2010',
  11: 'Dec-2010',
  12: 'Jan-2011',
  13: 'Feb-2011',
  14: 'Mar-2011',
  15: 'Apr-2011',
  16: 'May-2011',
  17: 'Jun-2011',
  18: 'Jul-2011',
  19: 'Aug-2011',
  20: 'Sep-2011',
  21: 'Oct-2011',
  22: 'Nov-2011',
  23: 'Dec-2011',
  24: 'Jan-2012',
  25: 'Feb-2012',
  26: 'Mar-2012',
  27: 'Apr-2012',
  28: 'May-2012',
  29: 'Jun-2012',
  30: 'Jul-2012',
  31: 'Aug-2012',
  32: 'Sep-2012',
  33: 'Oct-2012',
  34: 'Nov-2012',
  35: 'Dec-2012',
  36: 'Jan-2013',
  37: 'Feb-2013',
  38: 'Mar-2013',
  39: 'Apr-2013',
  40: 'May-2013',
  41: 'Jun-2013',
  42: 'Jul-2013',
  43: 'Aug-2013',
  44: 'Sep-2013',
  45: 'Oct-2013',
  46: 'Nov-2013',
  47: 'Dec-2013',
  48: 'Jan-2014',
  49: 'Feb-2014',
  50: 'Mar-2014',
  51: 'Apr-2014',
  52: 'May-2014',
  53: 'Jun-2014',
  54: 'Jul-2014',
  55: 'Aug-2014',
  56: 'Sep-2014',
  57: 'Oct-2014',
  58: 'Nov-2014',
  59: 'Dec-2014',
  60: 'Jan-2015',
  61: 'Feb-2015',
  62: 'Mar-2015',
  63: 'Apr-2015',
  64: 'May-2015',
  65: 'Jun-2015',
  66: 'Jul-2015',
  67: 'Aug-2015',
  68: 'Sep-2015',
  69: 'Oct-2015',
  70: 'Nov-2015',
  71: 'Dec-2015',
  72: 'Jan-2016',
  73: 'Feb-2016',
  74: 'Mar-2016',
  75: 'Apr-2016',
  76: 'May-2016',
  77: 'Jun-2016',
  78: 'Jul-2016',
  79: 'Aug-2016',
  80: 'Sep-2016',
  81: 'Oct-2016',
  82: 'Nov-2016',
  83: 'Dec-2016',
  84: 'Jan-2017',
  85: 'Feb-2017'},
 'Profit/Losses': {0: 867884,
  1: 984655,
  2: 322013,
  3: -69417,
  4: 310503,
  5: 522857,
  6: 1033096,
  7: 604885,
  8: -216386,
  9: 477532,
  10: 893810,
  11: -80353,
  12: 779806,
  13: -335203,
  14: 697845,
  15: 793163,
  16: 485070,
  17: 584122,
  18: 62729,
  19: 668179,
  20: 899906,
  21: 834719,
  22: 132003,
  23: 309978,
  24: -755566,
  25: 1170593,
  26: 252788,
  27: 1151518,
  28: 817256,
  29: 570757,
  30: 506702,
  31: -1022534,
  32: 475062,
  33: 779976,
  34: 144175,
  35: 542494,
  36: 359333,
  37: 321469,
  38: 67780,
  39: 471435,
  40: 565603,
  41: 872480,
  42: 789480,
  43: 999942,
  44: -1196225,
  45: 268997,
  46: -687986,
  47: 1150461,
  48: 682458,
  49: 617856,
  50: 824098,
  51: 581943,
  52: 132864,
  53: 448062,
  54: 689161,
  55: 800701,
  56: 1166643,
  57: 947333,
  58: 578668,
  59: 988505,
  60: 1139715,
  61: 1029471,
  62: 687533,
  63: -524626,
  64: 158620,
  65: 87795,
  66: 423389,
  67: 840723,
  68: 568529,
  69: 332067,
  70: 989499,
  71: 778237,
  72: 650000,
  73: -1100387,
  74: -174946,
  75: 757143,
  76: 445709,
  77: 712961,
  78: -1163797,
  79: 569899,
  80: 768450,
  81: 102685,
  82: 795914,
  83: 60988,
  84: 138230,
  85: 671099}}

In [68]:
month_count = 0

for month in d["Date"]:
    month_count += 1

month_count

86

In [84]:
sum(d["Profit/Losses"])

38382578